Revit 2027 API
TextBox.SelectTextOnFocus Property
 A value that indicates if the text is selected when the text box gains focus.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SelectTextOnFocus { get; set; }
Public Property SelectTextOnFocus As Boolean
	Get
	Set
public:
property bool SelectTextOnFocus {
	bool get ();
	void set (bool value);
}
member SelectTextOnFocus : bool with get, set
Property Value
Boolean
Remarks
If the value is true all the text in the text box will be selected when the text box gets keyboard focus. If it is false the text is not selected. The default value is false.
See Also
Reference
TextBox Class
Autodesk.Revit.UI Namespace